SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.h
#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_


/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/* PTA12 (number AG16), BATT_ADC_EN */
#define INIT_GPIO_PINS_BATT_ADC_EN_PERIPHERAL                                PTA   /*!< Device name: PTA */
#define INIT_GPIO_PINS_BATT_ADC_EN_SIGNAL                                   port   /*!< PTA signal: port */
#define INIT_GPIO_PINS_BATT_ADC_EN_CHANNEL                                    12   /*!< PTA port channel: 12 */
#define INIT_GPIO_PINS_BATT_ADC_EN_PIN_NAME                                PTA12   /*!< Pin name */
#define INIT_GPIO_PINS_BATT_ADC_EN_PIN_FUNCTION_ID            IOMUXC_PTA12_PTA12   /*!< Pin function id */
#define INIT_GPIO_PINS_BATT_ADC_EN_LABEL                           "BATT_ADC_EN"   /*!< Label */
#define INIT_GPIO_PINS_BATT_ADC_EN_NAME                            "BATT_ADC_EN"   /*!< Identifier name */
#define INIT_GPIO_PINS_BATT_ADC_EN_DIRECTION                 kGPIO_DigitalOutput   /*!< Direction */

/* PTA13 (number AF16), VOL- */
#define INIT_GPIO_PINS_VOL_DOWN_PERIPHERAL                                   PTA   /*!< Device name: PTA */
#define INIT_GPIO_PINS_VOL_DOWN_SIGNAL                                      port   /*!< PTA signal: port */
#define INIT_GPIO_PINS_VOL_DOWN_CHANNEL                                       13   /*!< PTA port channel: 13 */
#define INIT_GPIO_PINS_VOL_DOWN_PIN_NAME                                   PTA13   /*!< Pin name */
#define INIT_GPIO_PINS_VOL_DOWN_PIN_FUNCTION_ID               IOMUXC_PTA13_PTA13   /*!< Pin function id */
#define INIT_GPIO_PINS_VOL_DOWN_LABEL                                     "VOL-"   /*!< Label */
#define INIT_GPIO_PINS_VOL_DOWN_NAME                                  "VOL_DOWN"   /*!< Identifier name */
#define INIT_GPIO_PINS_VOL_DOWN_DIRECTION                     kGPIO_DigitalInput   /*!< Direction */

/* PTA14 (number AF17), WL_REG_ON */
#define INIT_GPIO_PINS_WL_REG_ON_PERIPHERAL                                  PTA   /*!< Device name: PTA */
#define INIT_GPIO_PINS_WL_REG_ON_SIGNAL                                     port   /*!< PTA signal: port */
#define INIT_GPIO_PINS_WL_REG_ON_CHANNEL                                      14   /*!< PTA port channel: 14 */
#define INIT_GPIO_PINS_WL_REG_ON_PIN_NAME                                  PTA14   /*!< Pin name */
#define INIT_GPIO_PINS_WL_REG_ON_PIN_FUNCTION_ID              IOMUXC_PTA14_PTA14   /*!< Pin function id */
#define INIT_GPIO_PINS_WL_REG_ON_LABEL                               "WL_REG_ON"   /*!< Label */
#define INIT_GPIO_PINS_WL_REG_ON_NAME                                "WL_REG_ON"   /*!< Identifier name */
#define INIT_GPIO_PINS_WL_REG_ON_DIRECTION                   kGPIO_DigitalOutput   /*!< Direction */

/* PTA15 (number AF18), BT_REG_ON */
#define INIT_GPIO_PINS_BT_REG_ON_PERIPHERAL                                  PTA   /*!< Device name: PTA */
#define INIT_GPIO_PINS_BT_REG_ON_SIGNAL                                     port   /*!< PTA signal: port */
#define INIT_GPIO_PINS_BT_REG_ON_CHANNEL                                      15   /*!< PTA port channel: 15 */
#define INIT_GPIO_PINS_BT_REG_ON_PIN_NAME                                  PTA15   /*!< Pin name */
#define INIT_GPIO_PINS_BT_REG_ON_PIN_FUNCTION_ID              IOMUXC_PTA15_PTA15   /*!< Pin function id */
#define INIT_GPIO_PINS_BT_REG_ON_LABEL                               "BT_REG_ON"   /*!< Label */
#define INIT_GPIO_PINS_BT_REG_ON_NAME                                "BT_REG_ON"   /*!< Identifier name */
#define INIT_GPIO_PINS_BT_REG_ON_DIRECTION                   kGPIO_DigitalOutput   /*!< Direction */

/* PTA21 (number AB20), M4_PER_EN */
#define INIT_GPIO_PINS_M4_PER_EN_PERIPHERAL                                  PTA   /*!< Device name: PTA */
#define INIT_GPIO_PINS_M4_PER_EN_SIGNAL                                     port   /*!< PTA signal: port */
#define INIT_GPIO_PINS_M4_PER_EN_CHANNEL                                      21   /*!< PTA port channel: 21 */
#define INIT_GPIO_PINS_M4_PER_EN_PIN_NAME                                  PTA21   /*!< Pin name */
#define INIT_GPIO_PINS_M4_PER_EN_PIN_FUNCTION_ID              IOMUXC_PTA21_PTA21   /*!< Pin function id */
#define INIT_GPIO_PINS_M4_PER_EN_LABEL                               "M4_PER_EN"   /*!< Label */
#define INIT_GPIO_PINS_M4_PER_EN_NAME                                "M4_PER_EN"   /*!< Identifier name */
#define INIT_GPIO_PINS_M4_PER_EN_DIRECTION                   kGPIO_DigitalOutput   /*!< Direction */

/* PTA23 (number AD20), AUD_INT# */
#define INIT_GPIO_PINS_AUD_INT_PERIPHERAL                                    PTA   /*!< Device name: PTA */
#define INIT_GPIO_PINS_AUD_INT_SIGNAL                                       port   /*!< PTA signal: port */
#define INIT_GPIO_PINS_AUD_INT_CHANNEL                                        23   /*!< PTA port channel: 23 */
#define INIT_GPIO_PINS_AUD_INT_PIN_NAME                                    PTA23   /*!< Pin name */
#define INIT_GPIO_PINS_AUD_INT_PIN_FUNCTION_ID                IOMUXC_PTA23_PTA23   /*!< Pin function id */
#define INIT_GPIO_PINS_AUD_INT_LABEL                                  "AUD_INT#"   /*!< Label */
#define INIT_GPIO_PINS_AUD_INT_NAME                                    "AUD_INT"   /*!< Identifier name */
#define INIT_GPIO_PINS_AUD_INT_DIRECTION                      kGPIO_DigitalInput   /*!< Direction */

/* PTA24 (number AF20), AUD_PWR_EN */
#define INIT_GPIO_PINS_AUD_PWR_EN_PERIPHERAL                                 PTA   /*!< Device name: PTA */
#define INIT_GPIO_PINS_AUD_PWR_EN_SIGNAL                                    port   /*!< PTA signal: port */
#define INIT_GPIO_PINS_AUD_PWR_EN_CHANNEL                                     24   /*!< PTA port channel: 24 */
#define INIT_GPIO_PINS_AUD_PWR_EN_PIN_NAME                                 PTA24   /*!< Pin name */
#define INIT_GPIO_PINS_AUD_PWR_EN_PIN_FUNCTION_ID             IOMUXC_PTA24_PTA24   /*!< Pin function id */
#define INIT_GPIO_PINS_AUD_PWR_EN_LABEL                             "AUD_PWR_EN"   /*!< Label */
#define INIT_GPIO_PINS_AUD_PWR_EN_NAME                              "AUD_PWR_EN"   /*!< Identifier name */
#define INIT_GPIO_PINS_AUD_PWR_EN_DIRECTION                  kGPIO_DigitalOutput   /*!< Direction */

/* PTA25 (number AG20), A7_POW_EN# */
#define INIT_GPIO_PINS_A7_POW_EN_PERIPHERAL                                  PTA   /*!< Device name: PTA */
#define INIT_GPIO_PINS_A7_POW_EN_SIGNAL                                     port   /*!< PTA signal: port */
#define INIT_GPIO_PINS_A7_POW_EN_CHANNEL                                      25   /*!< PTA port channel: 25 */
#define INIT_GPIO_PINS_A7_POW_EN_PIN_NAME                                  PTA25   /*!< Pin name */
#define INIT_GPIO_PINS_A7_POW_EN_PIN_FUNCTION_ID              IOMUXC_PTA25_PTA25   /*!< Pin function id */
#define INIT_GPIO_PINS_A7_POW_EN_LABEL                              "A7_POW_EN#"   /*!< Label */
#define INIT_GPIO_PINS_A7_POW_EN_NAME                                "A7_POW_EN"   /*!< Identifier name */
#define INIT_GPIO_PINS_A7_POW_EN_DIRECTION                   kGPIO_DigitalOutput   /*!< Direction */

/* PTA3 (number AF14), VOL+ */
#define INIT_GPIO_PINS_VOL_UP_PERIPHERAL                                     PTA   /*!< Device name: PTA */
#define INIT_GPIO_PINS_VOL_UP_SIGNAL                                        port   /*!< PTA signal: port */
#define INIT_GPIO_PINS_VOL_UP_CHANNEL                                          3   /*!< PTA port channel: 3 */
#define INIT_GPIO_PINS_VOL_UP_PIN_NAME                                      PTA3   /*!< Pin name */
#define INIT_GPIO_PINS_VOL_UP_PIN_FUNCTION_ID                   IOMUXC_PTA3_PTA3   /*!< Pin function id */
#define INIT_GPIO_PINS_VOL_UP_LABEL                                       "VOL+"   /*!< Label */
#define INIT_GPIO_PINS_VOL_UP_NAME                                      "VOL_UP"   /*!< Identifier name */
#define INIT_GPIO_PINS_VOL_UP_DIRECTION                      kGPIO_DigitalOutput   /*!< Direction */

