SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.h
/* PTA31 (number AF24), WL_HOST_WAKE */
#define INIT_GPIO_PINS_WL_HOST_WAKE_PERIPHERAL                               PTA   /*!< Device name: PTA */
#define INIT_GPIO_PINS_WL_HOST_WAKE_SIGNAL                                  port   /*!< PTA signal: port */
#define INIT_GPIO_PINS_WL_HOST_WAKE_CHANNEL                                   31   /*!< PTA port channel: 31 */
#define INIT_GPIO_PINS_WL_HOST_WAKE_PIN_NAME                               PTA31   /*!< Pin name */
#define INIT_GPIO_PINS_WL_HOST_WAKE_PIN_FUNCTION_ID           IOMUXC_PTA31_PTA31   /*!< Pin function id */
#define INIT_GPIO_PINS_WL_HOST_WAKE_LABEL                         "WL_HOST_WAKE"   /*!< Label */
#define INIT_GPIO_PINS_WL_HOST_WAKE_NAME                          "WL_HOST_WAKE"   /*!< Identifier name */
#define INIT_GPIO_PINS_WL_HOST_WAKE_DIRECTION                 kGPIO_DigitalInput   /*!< Direction */

/* PTB6 (number AF5), DDR_SW_EN# */
#define INIT_GPIO_PINS_DDR_SW_EN_PERIPHERAL                                  PTB   /*!< Device name: PTB */
#define INIT_GPIO_PINS_DDR_SW_EN_SIGNAL                                     port   /*!< PTB signal: port */
#define INIT_GPIO_PINS_DDR_SW_EN_CHANNEL                                       6   /*!< PTB port channel: 6 */
#define INIT_GPIO_PINS_DDR_SW_EN_PIN_NAME                                   PTB6   /*!< Pin name */
#define INIT_GPIO_PINS_DDR_SW_EN_PIN_FUNCTION_ID                IOMUXC_PTB6_PTB6   /*!< Pin function id */
#define INIT_GPIO_PINS_DDR_SW_EN_LABEL                              "DDR_SW_EN#"   /*!< Label */
#define INIT_GPIO_PINS_DDR_SW_EN_NAME                                "DDR_SW_EN"   /*!< Identifier name */
#define INIT_GPIO_PINS_DDR_SW_EN_DIRECTION                   kGPIO_DigitalOutput   /*!< Direction */

/* PTB7 (number AF6), BT_HOST_WAKE */
#define INIT_GPIO_PINS_BT_HOST_WAKE_PERIPHERAL                               PTB   /*!< Device name: PTB */
#define INIT_GPIO_PINS_BT_HOST_WAKE_SIGNAL                                  port   /*!< PTB signal: port */
#define INIT_GPIO_PINS_BT_HOST_WAKE_CHANNEL                                    7   /*!< PTB port channel: 7 */
#define INIT_GPIO_PINS_BT_HOST_WAKE_PIN_NAME                                PTB7   /*!< Pin name */
#define INIT_GPIO_PINS_BT_HOST_WAKE_PIN_FUNCTION_ID             IOMUXC_PTB7_PTB7   /*!< Pin function id */
#define INIT_GPIO_PINS_BT_HOST_WAKE_LABEL                         "BT_HOST_WAKE"   /*!< Label */
#define INIT_GPIO_PINS_BT_HOST_WAKE_NAME                          "BT_HOST_WAKE"   /*!< Identifier name */
#define INIT_GPIO_PINS_BT_HOST_WAKE_DIRECTION                 kGPIO_DigitalInput   /*!< Direction */

/* PTB9 (number AD7), SEN_INT# */
#define INIT_GPIO_PINS_SEN_INT_PERIPHERAL                                    PTB   /*!< Device name: PTB */
#define INIT_GPIO_PINS_SEN_INT_SIGNAL                                       port   /*!< PTB signal: port */
#define INIT_GPIO_PINS_SEN_INT_CHANNEL                                         9   /*!< PTB port channel: 9 */
#define INIT_GPIO_PINS_SEN_INT_PIN_NAME                                     PTB9   /*!< Pin name */
#define INIT_GPIO_PINS_SEN_INT_PIN_FUNCTION_ID                  IOMUXC_PTB9_PTB9   /*!< Pin function id */
#define INIT_GPIO_PINS_SEN_INT_LABEL                                  "SEN_INT#"   /*!< Label */
#define INIT_GPIO_PINS_SEN_INT_NAME                                    "SEN_INT"   /*!< Identifier name */
#define INIT_GPIO_PINS_SEN_INT_DIRECTION                      kGPIO_DigitalInput   /*!< Direction */

/* PTB11 (number AB7), PMIC_INT# */
#define INIT_GPIO_PINS_PMIC_INT_PERIPHERAL                                   PTB   /*!< Device name: PTB */
#define INIT_GPIO_PINS_PMIC_INT_SIGNAL                                      port   /*!< PTB signal: port */
#define INIT_GPIO_PINS_PMIC_INT_CHANNEL                                       11   /*!< PTB port channel: 11 */
#define INIT_GPIO_PINS_PMIC_INT_PIN_NAME                                   PTB11   /*!< Pin name */
#define INIT_GPIO_PINS_PMIC_INT_PIN_FUNCTION_ID               IOMUXC_PTB11_PTB11   /*!< Pin function id */
#define INIT_GPIO_PINS_PMIC_INT_LABEL                                "PMIC_INT#"   /*!< Label */
#define INIT_GPIO_PINS_PMIC_INT_NAME                                  "PMIC_INT"   /*!< Identifier name */
#define INIT_GPIO_PINS_PMIC_INT_DIRECTION                     kGPIO_DigitalInput   /*!< Direction */

/* PTC0 (coord D18), USB_OTG_PWR_EN */
#define INIT_GPIO_PINS_USB_OTG_PWR_EN_PERIPHERAL                             PTC   /*!< Device name: PTC */
#define INIT_GPIO_PINS_USB_OTG_PWR_EN_SIGNAL                                port   /*!< PTC signal: port */
#define INIT_GPIO_PINS_USB_OTG_PWR_EN_CHANNEL                                  0   /*!< PTC port channel: 0 */
#define INIT_GPIO_PINS_USB_OTG_PWR_EN_PIN_NAME                              PTC0   /*!< Pin name */
#define INIT_GPIO_PINS_USB_OTG_PWR_EN_PIN_FUNCTION_ID           IOMUXC_PTC0_PTC0   /*!< Pin function id */
#define INIT_GPIO_PINS_USB_OTG_PWR_EN_LABEL                     "USB_OTG_PWR_EN"   /*!< Label */
#define INIT_GPIO_PINS_USB_OTG_PWR_EN_NAME                      "USB_OTG_PWR_EN"   /*!< Identifier name */
#define INIT_GPIO_PINS_USB_OTG_PWR_EN_DIRECTION              kGPIO_DigitalOutput   /*!< Direction */

/* PTC10 (coord B15), SD0_CD */
#define INIT_GPIO_PINS_SD0_CD_PERIPHERAL                                     PTC   /*!< Device name: PTC */
#define INIT_GPIO_PINS_SD0_CD_SIGNAL                                        port   /*!< PTC signal: port */
#define INIT_GPIO_PINS_SD0_CD_CHANNEL                                         10   /*!< PTC port channel: 10 */
#define INIT_GPIO_PINS_SD0_CD_PIN_NAME                                     PTC10   /*!< Pin name */
#define INIT_GPIO_PINS_SD0_CD_PIN_FUNCTION_ID                 IOMUXC_PTC10_PTC10   /*!< Pin function id */
#define INIT_GPIO_PINS_SD0_CD_LABEL                                     "SD0_CD"   /*!< Label */
#define INIT_GPIO_PINS_SD0_CD_NAME                                      "SD0_CD"   /*!< Identifier name */
#define INIT_GPIO_PINS_SD0_CD_DIRECTION                       kGPIO_DigitalInput   /*!< Direction */

/* PTC11 (coord B14), USB_CC_SEL */
#define INIT_GPIO_PINS_USB_CC_SEL_PERIPHERAL                                 PTC   /*!< Device name: PTC */
#define INIT_GPIO_PINS_USB_CC_SEL_SIGNAL                                    port   /*!< PTC signal: port */
#define INIT_GPIO_PINS_USB_CC_SEL_CHANNEL                                     11   /*!< PTC port channel: 11 */
#define INIT_GPIO_PINS_USB_CC_SEL_PIN_NAME                                 PTC11   /*!< Pin name */
#define INIT_GPIO_PINS_USB_CC_SEL_PIN_FUNCTION_ID             IOMUXC_PTC11_PTC11   /*!< Pin function id */
#define INIT_GPIO_PINS_USB_CC_SEL_LABEL                             "USB_CC_SEL"   /*!< Label */
#define INIT_GPIO_PINS_USB_CC_SEL_NAME                              "USB_CC_SEL"   /*!< Identifier name */
#define INIT_GPIO_PINS_USB_CC_SEL_DIRECTION                   kGPIO_DigitalInput   /*!< Direction */

/* PTC12 (coord A14), USB_INT_B */
#define INIT_GPIO_PINS_USB_INT_B_PERIPHERAL                                  PTC   /*!< Device name: PTC */
#define INIT_GPIO_PINS_USB_INT_B_SIGNAL                                     port   /*!< PTC signal: port */
#define INIT_GPIO_PINS_USB_INT_B_CHANNEL                                      12   /*!< PTC port channel: 12 */
#define INIT_GPIO_PINS_USB_INT_B_PIN_NAME                                  PTC12   /*!< Pin name */
#define INIT_GPIO_PINS_USB_INT_B_PIN_FUNCTION_ID              IOMUXC_PTC12_PTC12   /*!< Pin function id */
#define INIT_GPIO_PINS_USB_INT_B_LABEL                               "USB_INT_B"   /*!< Label */
#define INIT_GPIO_PINS_USB_INT_B_NAME                                "USB_INT_B"   /*!< Identifier name */
#define INIT_GPIO_PINS_USB_INT_B_DIRECTION                    kGPIO_DigitalInput   /*!< Direction */

/* PTC14 (coord E13), PTC14 */
#define INIT_GPIO_PINS_PTC14_PERIPHERAL                                      PTC   /*!< Device name: PTC */
#define INIT_GPIO_PINS_PTC14_SIGNAL                                         port   /*!< PTC signal: port */
#define INIT_GPIO_PINS_PTC14_CHANNEL                                          14   /*!< PTC port channel: 14 */
#define INIT_GPIO_PINS_PTC14_PIN_NAME                                      PTC14   /*!< Pin name */
#define INIT_GPIO_PINS_PTC14_PIN_FUNCTION_ID                  IOMUXC_PTC14_PTC14   /*!< Pin function id */
#define INIT_GPIO_PINS_PTC14_LABEL                                       "PTC14"   /*!< Label */
#define INIT_GPIO_PINS_PTC14_NAME                                        "PTC14"   /*!< Identifier name */
#define INIT_GPIO_PINS_PTC14_DIRECTION                       kGPIO_DigitalOutput   /*!< Direction */

/* PTC15 (coord F13), PTC15 */
#define INIT_GPIO_PINS_PTC15_PERIPHERAL                                      PTC   /*!< Device name: PTC */
#define INIT_GPIO_PINS_PTC15_SIGNAL                                         port   /*!< PTC signal: port */
#define INIT_GPIO_PINS_PTC15_CHANNEL                                          15   /*!< PTC port channel: 15 */
#define INIT_GPIO_PINS_PTC15_PIN_NAME                                      PTC15   /*!< Pin name */
#define INIT_GPIO_PINS_PTC15_PIN_FUNCTION_ID                  IOMUXC_PTC15_PTC15   /*!< Pin function id */
#define INIT_GPIO_PINS_PTC15_LABEL                                       "PTC15"   /*!< Label */
#define INIT_GPIO_PINS_PTC15_NAME                                        "PTC15"   /*!< Identifier name */
#define INIT_GPIO_PINS_PTC15_DIRECTION                       kGPIO_DigitalOutput   /*!< Direction */

/* PTC17 (coord G12), PTC17 */
#define INIT_GPIO_PINS_PTC17_PERIPHERAL                                      PTC   /*!< Device name: PTC */
#define INIT_GPIO_PINS_PTC17_SIGNAL                                         port   /*!< PTC signal: port */
#define INIT_GPIO_PINS_PTC17_CHANNEL                                          17   /*!< PTC port channel: 17 */
#define INIT_GPIO_PINS_PTC17_PIN_NAME                                      PTC17   /*!< Pin name */
#define INIT_GPIO_PINS_PTC17_PIN_FUNCTION_ID                  IOMUXC_PTC17_PTC17   /*!< Pin function id */
#define INIT_GPIO_PINS_PTC17_LABEL                                       "PTC17"   /*!< Label */
#define INIT_GPIO_PINS_PTC17_NAME                                        "PTC17"   /*!< Identifier name */
#define INIT_GPIO_PINS_PTC17_DIRECTION                       kGPIO_DigitalOutput   /*!< Direction */

/* PTC18 (coord F12), DSI_HDMI_INT# */
#define INIT_GPIO_PINS_DSI_HDMI_INT_PERIPHERAL                               PTC   /*!< Device name: PTC */
#define INIT_GPIO_PINS_DSI_HDMI_INT_SIGNAL                                  port   /*!< PTC signal: port */
#define INIT_GPIO_PINS_DSI_HDMI_INT_CHANNEL                                   18   /*!< PTC port channel: 18 */
#define INIT_GPIO_PINS_DSI_HDMI_INT_PIN_NAME                               PTC18   /*!< Pin name */
#define INIT_GPIO_PINS_DSI_HDMI_INT_PIN_FUNCTION_ID           IOMUXC_PTC18_PTC18   /*!< Pin function id */
#define INIT_GPIO_PINS_DSI_HDMI_INT_LABEL                        "DSI_HDMI_INT#"   /*!< Label */
#define INIT_GPIO_PINS_DSI_HDMI_INT_NAME                          "DSI_HDMI_INT"   /*!< Identifier name */
#define INIT_GPIO_PINS_DSI_HDMI_INT_DIRECTION                 kGPIO_DigitalInput   /*!< Direction */

/* PTC19 (coord E12), MIPI_RESET_B */
#define INIT_GPIO_PINS_MIPI_RESET_B_PERIPHERAL                               PTC   /*!< Device name: PTC */
#define INIT_GPIO_PINS_MIPI_RESET_B_SIGNAL                                  port   /*!< PTC signal: port */
#define INIT_GPIO_PINS_MIPI_RESET_B_CHANNEL                                   19   /*!< PTC port channel: 19 */
#define INIT_GPIO_PINS_MIPI_RESET_B_PIN_NAME                               PTC19   /*!< Pin name */
#define INIT_GPIO_PINS_MIPI_RESET_B_PIN_FUNCTION_ID           IOMUXC_PTC19_PTC19   /*!< Pin function id */
#define INIT_GPIO_PINS_MIPI_RESET_B_LABEL                         "MIPI_RESET_B"   /*!< Label */
#define INIT_GPIO_PINS_MIPI_RESET_B_NAME                          "MIPI_RESET_B"   /*!< Identifier name */
#define INIT_GPIO_PINS_MIPI_RESET_B_DIRECTION                kGPIO_DigitalOutput   /*!< Direction */

/* PTE12 (coord B8), BT_DEV_WAKE */
#define INIT_GPIO_PINS_BT_DEV_WAKE_PERIPHERAL                                PTE   /*!< Device name: PTE */
#define INIT_GPIO_PINS_BT_DEV_WAKE_SIGNAL                                   port   /*!< PTE signal: port */
#define INIT_GPIO_PINS_BT_DEV_WAKE_CHANNEL                                    12   /*!< PTE port channel: 12 */
#define INIT_GPIO_PINS_BT_DEV_WAKE_PIN_NAME                                PTE12   /*!< Pin name */
#define INIT_GPIO_PINS_BT_DEV_WAKE_PIN_FUNCTION_ID            IOMUXC_PTE12_PTE12   /*!< Pin function id */
#define INIT_GPIO_PINS_BT_DEV_WAKE_LABEL                           "BT_DEV_WAKE"   /*!< Label */
#define INIT_GPIO_PINS_BT_DEV_WAKE_NAME                            "BT_DEV_WAKE"   /*!< Identifier name */
#define INIT_GPIO_PINS_BT_DEV_WAKE_DIRECTION                 kGPIO_DigitalOutput   /*!< Direction */

/* PTF0 (coord D2), TOUCH_INT# */
#define INIT_GPIO_PINS_TOUCH_INT_PERIPHERAL                                  PTF   /*!< Device name: PTF */
#define INIT_GPIO_PINS_TOUCH_INT_SIGNAL                                     port   /*!< PTF signal: port */
#define INIT_GPIO_PINS_TOUCH_INT_CHANNEL                                       0   /*!< PTF port channel: 0 */
#define INIT_GPIO_PINS_TOUCH_INT_PIN_NAME                                   PTF0   /*!< Pin name */
#define INIT_GPIO_PINS_TOUCH_INT_PIN_FUNCTION_ID                IOMUXC_PTF0_PTF0   /*!< Pin function id */
#define INIT_GPIO_PINS_TOUCH_INT_LABEL                              "TOUCH_INT#"   /*!< Label */
#define INIT_GPIO_PINS_TOUCH_INT_NAME                                "TOUCH_INT"   /*!< Identifier name */
#define INIT_GPIO_PINS_TOUCH_INT_DIRECTION                    kGPIO_DigitalInput   /*!< Direction */

