SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.h
/* PTF1 (coord B2), TOUCH_RST_B */
#define INIT_GPIO_PINS_TOUCH_RST_B_PERIPHERAL                                PTF   /*!< Device name: PTF */
#define INIT_GPIO_PINS_TOUCH_RST_B_SIGNAL                                   port   /*!< PTF signal: port */
#define INIT_GPIO_PINS_TOUCH_RST_B_CHANNEL                                     1   /*!< PTF port channel: 1 */
#define INIT_GPIO_PINS_TOUCH_RST_B_PIN_NAME                                 PTF1   /*!< Pin name */
#define INIT_GPIO_PINS_TOUCH_RST_B_PIN_FUNCTION_ID              IOMUXC_PTF1_PTF1   /*!< Pin function id */
#define INIT_GPIO_PINS_TOUCH_RST_B_LABEL                           "TOUCH_RST_B"   /*!< Label */
#define INIT_GPIO_PINS_TOUCH_RST_B_NAME                            "TOUCH_RST_B"   /*!< Identifier name */
#define INIT_GPIO_PINS_TOUCH_RST_B_DIRECTION                 kGPIO_DigitalOutput   /*!< Direction */

/* PTF10 (coord G5), PTF10 */
#define INIT_GPIO_PINS_PTF10_PERIPHERAL                                      PTF   /*!< Device name: PTF */
#define INIT_GPIO_PINS_PTF10_SIGNAL                                         port   /*!< PTF signal: port */
#define INIT_GPIO_PINS_PTF10_CHANNEL                                          10   /*!< PTF port channel: 10 */
#define INIT_GPIO_PINS_PTF10_PIN_NAME                                      PTF10   /*!< Pin name */
#define INIT_GPIO_PINS_PTF10_PIN_FUNCTION_ID                  IOMUXC_PTF10_PTF10   /*!< Pin function id */
#define INIT_GPIO_PINS_PTF10_LABEL                                       "PTF10"   /*!< Label */
#define INIT_GPIO_PINS_PTF10_NAME                                        "PTF10"   /*!< Identifier name */
#define INIT_GPIO_PINS_PTF10_DIRECTION                       kGPIO_DigitalOutput   /*!< Direction */

/* PTF11 (coord G6), PTF11 */
#define INIT_GPIO_PINS_PTF11_PERIPHERAL                                      PTF   /*!< Device name: PTF */
#define INIT_GPIO_PINS_PTF11_SIGNAL                                         port   /*!< PTF signal: port */
#define INIT_GPIO_PINS_PTF11_CHANNEL                                          11   /*!< PTF port channel: 11 */
#define INIT_GPIO_PINS_PTF11_PIN_NAME                                      PTF11   /*!< Pin name */
#define INIT_GPIO_PINS_PTF11_PIN_FUNCTION_ID                  IOMUXC_PTF11_PTF11   /*!< Pin function id */
#define INIT_GPIO_PINS_PTF11_LABEL                                       "PTF11"   /*!< Label */
#define INIT_GPIO_PINS_PTF11_NAME                                        "PTF11"   /*!< Identifier name */
#define INIT_GPIO_PINS_PTF11_DIRECTION                       kGPIO_DigitalOutput   /*!< Direction */

/* PTA2 (number AG14), I2S0_RXD0 */
#define INIT_I2S_PINS_I2S0_RXD0_PERIPHERAL                                  I2S0   /*!< Device name: I2S0 */
#define INIT_I2S_PINS_I2S0_RXD0_SIGNAL                                   i2s_rxd   /*!< I2S0 signal: i2s_rxd */
#define INIT_I2S_PINS_I2S0_RXD0_CHANNEL                                        0   /*!< I2S0 i2s_rxd channel: 0 */
#define INIT_I2S_PINS_I2S0_RXD0_PIN_NAME                                    PTA2   /*!< Pin name */
#define INIT_I2S_PINS_I2S0_RXD0_PIN_FUNCTION_ID            IOMUXC_PTA2_I2S0_RXD0   /*!< Pin function id */
#define INIT_I2S_PINS_I2S0_RXD0_LABEL                                "I2S0_RXD0"   /*!< Label */
#define INIT_I2S_PINS_I2S0_RXD0_NAME                                 "I2S0_RXD0"   /*!< Identifier name */

/* PTA4 (number AD15), I2S0_MCLK */
#define INIT_I2S_PINS_I2S0_MCLK_PERIPHERAL                                  I2S0   /*!< Device name: I2S0 */
#define INIT_I2S_PINS_I2S0_MCLK_SIGNAL                                  i2s_mclk   /*!< I2S0 signal: i2s_mclk */
#define INIT_I2S_PINS_I2S0_MCLK_PIN_NAME                                    PTA4   /*!< Pin name */
#define INIT_I2S_PINS_I2S0_MCLK_PIN_FUNCTION_ID            IOMUXC_PTA4_I2S0_MCLK   /*!< Pin function id */
#define INIT_I2S_PINS_I2S0_MCLK_LABEL                                "I2S0_MCLK"   /*!< Label */
#define INIT_I2S_PINS_I2S0_MCLK_NAME                                 "I2S0_MCLK"   /*!< Identifier name */

/* PTA5 (number AC15), I2S0_TX_BCLK */
#define INIT_I2S_PINS_I2S0_TX_BCLK_PERIPHERAL                               I2S0   /*!< Device name: I2S0 */
#define INIT_I2S_PINS_I2S0_TX_BCLK_SIGNAL                            i2s_tx_bclk   /*!< I2S0 signal: i2s_tx_bclk */
#define INIT_I2S_PINS_I2S0_TX_BCLK_PIN_NAME                                 PTA5   /*!< Pin name */
#define INIT_I2S_PINS_I2S0_TX_BCLK_PIN_FUNCTION_ID      IOMUXC_PTA5_I2S0_TX_BCLK   /*!< Pin function id */
#define INIT_I2S_PINS_I2S0_TX_BCLK_LABEL                          "I2S0_TX_BCLK"   /*!< Label */
#define INIT_I2S_PINS_I2S0_TX_BCLK_NAME                           "I2S0_TX_BCLK"   /*!< Identifier name */

/* PTA6 (number AB15), I2S0_TX_FS */
#define INIT_I2S_PINS_I2S0_TX_FS_PERIPHERAL                                 I2S0   /*!< Device name: I2S0 */
#define INIT_I2S_PINS_I2S0_TX_FS_SIGNAL                                i2s_tx_fs   /*!< I2S0 signal: i2s_tx_fs */
#define INIT_I2S_PINS_I2S0_TX_FS_PIN_NAME                                   PTA6   /*!< Pin name */
#define INIT_I2S_PINS_I2S0_TX_FS_PIN_FUNCTION_ID          IOMUXC_PTA6_I2S0_TX_FS   /*!< Pin function id */
#define INIT_I2S_PINS_I2S0_TX_FS_LABEL                              "I2S0_TX_FS"   /*!< Label */
#define INIT_I2S_PINS_I2S0_TX_FS_NAME                               "I2S0_TX_FS"   /*!< Identifier name */

/* PTA7 (number AD14), I2S0_TXD0 */
#define INIT_I2S_PINS_I2S0_TXD0_PERIPHERAL                                  I2S0   /*!< Device name: I2S0 */
#define INIT_I2S_PINS_I2S0_TXD0_SIGNAL                                   i2s_txd   /*!< I2S0 signal: i2s_txd */
#define INIT_I2S_PINS_I2S0_TXD0_CHANNEL                                        0   /*!< I2S0 i2s_txd channel: 0 */
#define INIT_I2S_PINS_I2S0_TXD0_PIN_NAME                                    PTA7   /*!< Pin name */
#define INIT_I2S_PINS_I2S0_TXD0_PIN_FUNCTION_ID            IOMUXC_PTA7_I2S0_TXD0   /*!< Pin function id */
#define INIT_I2S_PINS_I2S0_TXD0_LABEL                                "I2S0_TXD0"   /*!< Label */
#define INIT_I2S_PINS_I2S0_TXD0_NAME                                 "I2S0_TXD0"   /*!< Identifier name */

