SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.h
/* PTB1 (number AF2), I2S1_TX_BCLK */
#define INIT_I2S_PINS_I2S1_TX_BCLK_PERIPHERAL                               I2S1   /*!< Device name: I2S1 */
#define INIT_I2S_PINS_I2S1_TX_BCLK_SIGNAL                            i2s_tx_bclk   /*!< I2S1 signal: i2s_tx_bclk */
#define INIT_I2S_PINS_I2S1_TX_BCLK_PIN_NAME                                 PTB1   /*!< Pin name */
#define INIT_I2S_PINS_I2S1_TX_BCLK_PIN_FUNCTION_ID      IOMUXC_PTB1_I2S1_TX_BCLK   /*!< Pin function id */
#define INIT_I2S_PINS_I2S1_TX_BCLK_LABEL                          "I2S1_TX_BCLK"   /*!< Label */
#define INIT_I2S_PINS_I2S1_TX_BCLK_NAME                           "I2S1_TX_BCLK"   /*!< Identifier name */

/* PTB2 (number AE3), I2S1_TX_FS */
#define INIT_I2S_PINS_I2S1_TX_FS_PERIPHERAL                                 I2S1   /*!< Device name: I2S1 */
#define INIT_I2S_PINS_I2S1_TX_FS_SIGNAL                                i2s_tx_fs   /*!< I2S1 signal: i2s_tx_fs */
#define INIT_I2S_PINS_I2S1_TX_FS_PIN_NAME                                   PTB2   /*!< Pin name */
#define INIT_I2S_PINS_I2S1_TX_FS_PIN_FUNCTION_ID          IOMUXC_PTB2_I2S1_TX_FS   /*!< Pin function id */
#define INIT_I2S_PINS_I2S1_TX_FS_LABEL                              "I2S1_TX_FS"   /*!< Label */
#define INIT_I2S_PINS_I2S1_TX_FS_NAME                               "I2S1_TX_FS"   /*!< Identifier name */

/* PTB3 (number AE4), I2S1_TXD0 */
#define INIT_I2S_PINS_I2S1_TXD0_PERIPHERAL                                  I2S1   /*!< Device name: I2S1 */
#define INIT_I2S_PINS_I2S1_TXD0_SIGNAL                                   i2s_txd   /*!< I2S1 signal: i2s_txd */
#define INIT_I2S_PINS_I2S1_TXD0_CHANNEL                                        0   /*!< I2S1 i2s_txd channel: 0 */
#define INIT_I2S_PINS_I2S1_TXD0_PIN_NAME                                    PTB3   /*!< Pin name */
#define INIT_I2S_PINS_I2S1_TXD0_PIN_FUNCTION_ID            IOMUXC_PTB3_I2S1_TXD0   /*!< Pin function id */
#define INIT_I2S_PINS_I2S1_TXD0_LABEL                                "I2S1_TXD0"   /*!< Label */
#define INIT_I2S_PINS_I2S1_TXD0_NAME                                 "I2S1_TXD0"   /*!< Identifier name */

/* PTB10 (number AC7), I2S1_RXD0 */
#define INIT_I2S_PINS_I2S1_RXD0_PERIPHERAL                                  I2S1   /*!< Device name: I2S1 */
#define INIT_I2S_PINS_I2S1_RXD0_SIGNAL                                   i2s_rxd   /*!< I2S1 signal: i2s_rxd */
#define INIT_I2S_PINS_I2S1_RXD0_CHANNEL                                        0   /*!< I2S1 i2s_rxd channel: 0 */
#define INIT_I2S_PINS_I2S1_RXD0_PIN_NAME                                   PTB10   /*!< Pin name */
#define INIT_I2S_PINS_I2S1_RXD0_PIN_FUNCTION_ID           IOMUXC_PTB10_I2S1_RXD0   /*!< Pin function id */
#define INIT_I2S_PINS_I2S1_RXD0_LABEL                                "I2S1_RXD0"   /*!< Label */
#define INIT_I2S_PINS_I2S1_RXD0_NAME                                 "I2S1_RXD0"   /*!< Identifier name */

/* PTA8 (number AB16), UART2_CTS */
#define INIT_UART_PINS_UART2_CTS_PERIPHERAL                              LPUART2   /*!< Device name: LPUART2 */
#define INIT_UART_PINS_UART2_CTS_SIGNAL                             lpuart_cts_b   /*!< LPUART2 signal: lpuart_cts_b */
#define INIT_UART_PINS_UART2_CTS_PIN_NAME                                   PTA8   /*!< Pin name */
#define INIT_UART_PINS_UART2_CTS_PIN_FUNCTION_ID       IOMUXC_PTA8_LPUART2_CTS_B   /*!< Pin function id */
#define INIT_UART_PINS_UART2_CTS_LABEL                               "UART2_CTS"   /*!< Label */
#define INIT_UART_PINS_UART2_CTS_NAME                                "UART2_CTS"   /*!< Identifier name */

/* PTA9 (number AC16), UART2_RTS */
#define INIT_UART_PINS_UART2_RTS_PERIPHERAL                              LPUART2   /*!< Device name: LPUART2 */
#define INIT_UART_PINS_UART2_RTS_SIGNAL                             lpuart_rts_b   /*!< LPUART2 signal: lpuart_rts_b */
#define INIT_UART_PINS_UART2_RTS_PIN_NAME                                   PTA9   /*!< Pin name */
#define INIT_UART_PINS_UART2_RTS_PIN_FUNCTION_ID       IOMUXC_PTA9_LPUART2_RTS_B   /*!< Pin function id */
#define INIT_UART_PINS_UART2_RTS_LABEL                               "UART2_RTS"   /*!< Label */
#define INIT_UART_PINS_UART2_RTS_NAME                                "UART2_RTS"   /*!< Identifier name */

/* PTA10 (number AD16), UART2_TX */
#define INIT_UART_PINS_UART2_TX_PERIPHERAL                               LPUART2   /*!< Device name: LPUART2 */
#define INIT_UART_PINS_UART2_TX_SIGNAL                                 lpuart_tx   /*!< LPUART2 signal: lpuart_tx */
#define INIT_UART_PINS_UART2_TX_PIN_NAME                                   PTA10   /*!< Pin name */
#define INIT_UART_PINS_UART2_TX_PIN_FUNCTION_ID          IOMUXC_PTA10_LPUART2_TX   /*!< Pin function id */
#define INIT_UART_PINS_UART2_TX_LABEL                                 "UART2_TX"   /*!< Label */
#define INIT_UART_PINS_UART2_TX_NAME                                  "UART2_TX"   /*!< Identifier name */

/* PTA11 (number AD18), UART2_RX */
#define INIT_UART_PINS_UART2_RX_PERIPHERAL                               LPUART2   /*!< Device name: LPUART2 */
#define INIT_UART_PINS_UART2_RX_SIGNAL                                 lpuart_rx   /*!< LPUART2 signal: lpuart_rx */
#define INIT_UART_PINS_UART2_RX_PIN_NAME                                   PTA11   /*!< Pin name */
#define INIT_UART_PINS_UART2_RX_PIN_FUNCTION_ID          IOMUXC_PTA11_LPUART2_RX   /*!< Pin function id */
#define INIT_UART_PINS_UART2_RX_LABEL                                 "UART2_RX"   /*!< Label */
#define INIT_UART_PINS_UART2_RX_NAME                                  "UART2_RX"   /*!< Identifier name */

/* PTA18 (number AC19), UART0_TX */
#define INIT_UART_PINS_UART0_TX_PERIPHERAL                               LPUART0   /*!< Device name: LPUART0 */
#define INIT_UART_PINS_UART0_TX_SIGNAL                                 lpuart_tx   /*!< LPUART0 signal: lpuart_tx */
#define INIT_UART_PINS_UART0_TX_PIN_NAME                                   PTA18   /*!< Pin name */
#define INIT_UART_PINS_UART0_TX_PIN_FUNCTION_ID          IOMUXC_PTA18_LPUART0_TX   /*!< Pin function id */
#define INIT_UART_PINS_UART0_TX_LABEL                                 "UART0_TX"   /*!< Label */
#define INIT_UART_PINS_UART0_TX_NAME                                  "UART0_TX"   /*!< Identifier name */

/* PTA19 (number AB19), UART0_RX */
#define INIT_UART_PINS_UART0_RX_PERIPHERAL                               LPUART0   /*!< Device name: LPUART0 */
#define INIT_UART_PINS_UART0_RX_SIGNAL                                 lpuart_rx   /*!< LPUART0 signal: lpuart_rx */
#define INIT_UART_PINS_UART0_RX_PIN_NAME                                   PTA19   /*!< Pin name */
#define INIT_UART_PINS_UART0_RX_PIN_FUNCTION_ID          IOMUXC_PTA19_LPUART0_RX   /*!< Pin function id */
#define INIT_UART_PINS_UART0_RX_LABEL                                 "UART0_RX"   /*!< Label */
#define INIT_UART_PINS_UART0_RX_NAME                                  "UART0_RX"   /*!< Identifier name */

