SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.h
/* PTC2 (coord F17), UART4_TX */
#define INIT_UART_PINS_UART4_TX_PERIPHERAL                               LPUART4   /*!< Device name: LPUART4 */
#define INIT_UART_PINS_UART4_TX_SIGNAL                                 lpuart_tx   /*!< LPUART4 signal: lpuart_tx */
#define INIT_UART_PINS_UART4_TX_PIN_NAME                                    PTC2   /*!< Pin name */
#define INIT_UART_PINS_UART4_TX_PIN_FUNCTION_ID           IOMUXC_PTC2_LPUART4_TX   /*!< Pin function id */
#define INIT_UART_PINS_UART4_TX_LABEL                                 "UART4_TX"   /*!< Label */
#define INIT_UART_PINS_UART4_TX_NAME                                  "UART4_TX"   /*!< Identifier name */

/* PTC3 (coord G17), UART4_RX */
#define INIT_UART_PINS_UART4_RX_PERIPHERAL                               LPUART4   /*!< Device name: LPUART4 */
#define INIT_UART_PINS_UART4_RX_SIGNAL                                 lpuart_rx   /*!< LPUART4 signal: lpuart_rx */
#define INIT_UART_PINS_UART4_RX_PIN_NAME                                    PTC3   /*!< Pin name */
#define INIT_UART_PINS_UART4_RX_PIN_FUNCTION_ID           IOMUXC_PTC3_LPUART4_RX   /*!< Pin function id */
#define INIT_UART_PINS_UART4_RX_LABEL                                 "UART4_RX"   /*!< Label */
#define INIT_UART_PINS_UART4_RX_NAME                                  "UART4_RX"   /*!< Identifier name */

/* PTE8 (coord F9), UART6_CTS */
#define INIT_UART_PINS_UART6_CTS_PERIPHERAL                              LPUART6   /*!< Device name: LPUART6 */
#define INIT_UART_PINS_UART6_CTS_SIGNAL                             lpuart_cts_b   /*!< LPUART6 signal: lpuart_cts_b */
#define INIT_UART_PINS_UART6_CTS_PIN_NAME                                   PTE8   /*!< Pin name */
#define INIT_UART_PINS_UART6_CTS_PIN_FUNCTION_ID       IOMUXC_PTE8_LPUART6_CTS_B   /*!< Pin function id */
#define INIT_UART_PINS_UART6_CTS_LABEL                               "UART6_CTS"   /*!< Label */
#define INIT_UART_PINS_UART6_CTS_NAME                                "UART6_CTS"   /*!< Identifier name */

/* PTE9 (coord G9), UART6_RTS */
#define INIT_UART_PINS_UART6_RTS_PERIPHERAL                              LPUART6   /*!< Device name: LPUART6 */
#define INIT_UART_PINS_UART6_RTS_SIGNAL                             lpuart_rts_b   /*!< LPUART6 signal: lpuart_rts_b */
#define INIT_UART_PINS_UART6_RTS_PIN_NAME                                   PTE9   /*!< Pin name */
#define INIT_UART_PINS_UART6_RTS_PIN_FUNCTION_ID       IOMUXC_PTE9_LPUART6_RTS_B   /*!< Pin function id */
#define INIT_UART_PINS_UART6_RTS_LABEL                               "UART6_RTS"   /*!< Label */
#define INIT_UART_PINS_UART6_RTS_NAME                                "UART6_RTS"   /*!< Identifier name */

/* PTE10 (coord D8), UART6_TX */
#define INIT_UART_PINS_UART6_TX_PERIPHERAL                               LPUART6   /*!< Device name: LPUART6 */
#define INIT_UART_PINS_UART6_TX_SIGNAL                                 lpuart_tx   /*!< LPUART6 signal: lpuart_tx */
#define INIT_UART_PINS_UART6_TX_PIN_NAME                                   PTE10   /*!< Pin name */
#define INIT_UART_PINS_UART6_TX_PIN_FUNCTION_ID          IOMUXC_PTE10_LPUART6_TX   /*!< Pin function id */
#define INIT_UART_PINS_UART6_TX_LABEL                                 "UART6_TX"   /*!< Label */
#define INIT_UART_PINS_UART6_TX_NAME                                  "UART6_TX"   /*!< Identifier name */

/* PTE11 (coord A8), UART6_RX */
#define INIT_UART_PINS_UART6_RX_PERIPHERAL                               LPUART6   /*!< Device name: LPUART6 */
#define INIT_UART_PINS_UART6_RX_SIGNAL                                 lpuart_rx   /*!< LPUART6 signal: lpuart_rx */
#define INIT_UART_PINS_UART6_RX_PIN_NAME                                   PTE11   /*!< Pin name */
#define INIT_UART_PINS_UART6_RX_PIN_FUNCTION_ID          IOMUXC_PTE11_LPUART6_RX   /*!< Pin function id */
#define INIT_UART_PINS_UART6_RX_LABEL                                 "UART6_RX"   /*!< Label */
#define INIT_UART_PINS_UART6_RX_NAME                                  "UART6_RX"   /*!< Identifier name */

/* PTA16 (number AG18), I2C0_SCL */
#define INIT_I2C_PINS_I2C0_SCL_PERIPHERAL                                 LPI2C0   /*!< Device name: LPI2C0 */
#define INIT_I2C_PINS_I2C0_SCL_SIGNAL                                  lpi2c_scl   /*!< LPI2C0 signal: lpi2c_scl */
#define INIT_I2C_PINS_I2C0_SCL_PIN_NAME                                    PTA16   /*!< Pin name */
#define INIT_I2C_PINS_I2C0_SCL_PIN_FUNCTION_ID           IOMUXC_PTA16_LPI2C0_SCL   /*!< Pin function id */
#define INIT_I2C_PINS_I2C0_SCL_LABEL                                  "I2C0_SCL"   /*!< Label */
#define INIT_I2C_PINS_I2C0_SCL_NAME                                   "I2C0_SCL"   /*!< Identifier name */

/* PTA17 (number AD19), I2C0_SDA */
#define INIT_I2C_PINS_I2C0_SDA_PERIPHERAL                                 LPI2C0   /*!< Device name: LPI2C0 */
#define INIT_I2C_PINS_I2C0_SDA_SIGNAL                                  lpi2c_sda   /*!< LPI2C0 signal: lpi2c_sda */
#define INIT_I2C_PINS_I2C0_SDA_PIN_NAME                                    PTA17   /*!< Pin name */
#define INIT_I2C_PINS_I2C0_SDA_PIN_FUNCTION_ID           IOMUXC_PTA17_LPI2C0_SDA   /*!< Pin function id */
#define INIT_I2C_PINS_I2C0_SDA_LABEL                                  "I2C0_SDA"   /*!< Label */
#define INIT_I2C_PINS_I2C0_SDA_NAME                                   "I2C0_SDA"   /*!< Identifier name */

/* PTB12 (number AC8), I2C3_SCL */
#define INIT_I2C_PINS_I2C3_SCL_PERIPHERAL                                 LPI2C3   /*!< Device name: LPI2C3 */
#define INIT_I2C_PINS_I2C3_SCL_SIGNAL                                  lpi2c_scl   /*!< LPI2C3 signal: lpi2c_scl */
#define INIT_I2C_PINS_I2C3_SCL_PIN_NAME                                    PTB12   /*!< Pin name */
#define INIT_I2C_PINS_I2C3_SCL_PIN_FUNCTION_ID           IOMUXC_PTB12_LPI2C3_SCL   /*!< Pin function id */
#define INIT_I2C_PINS_I2C3_SCL_LABEL                                  "I2C3_SCL"   /*!< Label */
#define INIT_I2C_PINS_I2C3_SCL_NAME                                   "I2C3_SCL"   /*!< Identifier name */

/* PTB13 (number AD8), I2C3_SDA */
#define INIT_I2C_PINS_I2C3_SDA_PERIPHERAL                                 LPI2C3   /*!< Device name: LPI2C3 */
#define INIT_I2C_PINS_I2C3_SDA_SIGNAL                                  lpi2c_sda   /*!< LPI2C3 signal: lpi2c_sda */
#define INIT_I2C_PINS_I2C3_SDA_PIN_NAME                                    PTB13   /*!< Pin name */
#define INIT_I2C_PINS_I2C3_SDA_PIN_FUNCTION_ID           IOMUXC_PTB13_LPI2C3_SDA   /*!< Pin function id */
#define INIT_I2C_PINS_I2C3_SDA_LABEL                                  "I2C3_SDA"   /*!< Label */
#define INIT_I2C_PINS_I2C3_SDA_NAME                                   "I2C3_SDA"   /*!< Identifier name */

/* PTC4 (coord F16), I2C5_SCL */
#define INIT_I2C_PINS_I2C5_SCL_PERIPHERAL                                 LPI2C5   /*!< Device name: LPI2C5 */
#define INIT_I2C_PINS_I2C5_SCL_SIGNAL                                  lpi2c_scl   /*!< LPI2C5 signal: lpi2c_scl */
#define INIT_I2C_PINS_I2C5_SCL_PIN_NAME                                     PTC4   /*!< Pin name */
#define INIT_I2C_PINS_I2C5_SCL_PIN_FUNCTION_ID            IOMUXC_PTC4_LPI2C5_SCL   /*!< Pin function id */
#define INIT_I2C_PINS_I2C5_SCL_LABEL                                  "I2C5_SCL"   /*!< Label */
#define INIT_I2C_PINS_I2C5_SCL_NAME                                   "I2C5_SCL"   /*!< Identifier name */

/* PTC5 (coord D17), I2C5_SDA */
#define INIT_I2C_PINS_I2C5_SDA_PERIPHERAL                                 LPI2C5   /*!< Device name: LPI2C5 */
#define INIT_I2C_PINS_I2C5_SDA_SIGNAL                                  lpi2c_sda   /*!< LPI2C5 signal: lpi2c_sda */
#define INIT_I2C_PINS_I2C5_SDA_PIN_NAME                                     PTC5   /*!< Pin name */
#define INIT_I2C_PINS_I2C5_SDA_PIN_FUNCTION_ID            IOMUXC_PTC5_LPI2C5_SDA   /*!< Pin function id */
#define INIT_I2C_PINS_I2C5_SDA_LABEL                                  "I2C5_SDA"   /*!< Label */
#define INIT_I2C_PINS_I2C5_SDA_NAME                                   "I2C5_SDA"   /*!< Identifier name */

/* PTF12 (coord H7), I2C7_SCL */
#define INIT_I2C_PINS_I2C7_SCL_PERIPHERAL                                 LPI2C7   /*!< Device name: LPI2C7 */
#define INIT_I2C_PINS_I2C7_SCL_SIGNAL                                  lpi2c_scl   /*!< LPI2C7 signal: lpi2c_scl */
#define INIT_I2C_PINS_I2C7_SCL_PIN_NAME                                    PTF12   /*!< Pin name */
#define INIT_I2C_PINS_I2C7_SCL_PIN_FUNCTION_ID           IOMUXC_PTF12_LPI2C7_SCL   /*!< Pin function id */
#define INIT_I2C_PINS_I2C7_SCL_LABEL                                  "I2C7_SCL"   /*!< Label */
#define INIT_I2C_PINS_I2C7_SCL_NAME                                   "I2C7_SCL"   /*!< Identifier name */

