SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.h
/* PTF13 (coord H6), I2C7_SDA */
#define INIT_I2C_PINS_I2C7_SDA_PERIPHERAL                                 LPI2C7   /*!< Device name: LPI2C7 */
#define INIT_I2C_PINS_I2C7_SDA_SIGNAL                                  lpi2c_sda   /*!< LPI2C7 signal: lpi2c_sda */
#define INIT_I2C_PINS_I2C7_SDA_PIN_NAME                                    PTF13   /*!< Pin name */
#define INIT_I2C_PINS_I2C7_SDA_PIN_FUNCTION_ID           IOMUXC_PTF13_LPI2C7_SDA   /*!< Pin function id */
#define INIT_I2C_PINS_I2C7_SDA_LABEL                                  "I2C7_SDA"   /*!< Label */
#define INIT_I2C_PINS_I2C7_SDA_NAME                                   "I2C7_SDA"   /*!< Identifier name */

/* PTA20 (number AD22), BATT_ADC_IN */
#define INIT_ADC_PINS_BATT_ADC_IN_PERIPHERAL                                ADC0   /*!< Device name: ADC0 */
#define INIT_ADC_PINS_BATT_ADC_IN_SIGNAL                               adc_ch10a   /*!< ADC0 signal: adc_ch10a */
#define INIT_ADC_PINS_BATT_ADC_IN_PIN_NAME                                 PTA20   /*!< Pin name */
#define INIT_ADC_PINS_BATT_ADC_IN_PIN_FUNCTION_ID        IOMUXC_PTA20_ADC0_CH10A   /*!< Pin function id */
#define INIT_ADC_PINS_BATT_ADC_IN_LABEL                            "BATT_ADC_IN"   /*!< Label */
#define INIT_ADC_PINS_BATT_ADC_IN_NAME                             "BATT_ADC_IN"   /*!< Identifier name */

/* PTA8 (number AB16), UART2_CTS */
#define INIT_ADC_PINS_ADC1_CH5A_PERIPHERAL                                  ADC1   /*!< Device name: ADC1 */
#define INIT_ADC_PINS_ADC1_CH5A_SIGNAL                                  adc_ch5a   /*!< ADC1 signal: adc_ch5a */
#define INIT_ADC_PINS_ADC1_CH5A_PIN_NAME                                    PTA8   /*!< Pin name */
#define INIT_ADC_PINS_ADC1_CH5A_PIN_FUNCTION_ID            IOMUXC_PTA8_ADC1_CH5A   /*!< Pin function id */
#define INIT_ADC_PINS_ADC1_CH5A_LABEL                                "UART2_CTS"   /*!< Label */
#define INIT_ADC_PINS_ADC1_CH5A_NAME                                 "ADC1_CH5A"   /*!< Identifier name */

/* PTA9 (number AC16), UART2_RTS */
#define INIT_ADC_PINS_ADC1_CH5B_PERIPHERAL                                  ADC1   /*!< Device name: ADC1 */
#define INIT_ADC_PINS_ADC1_CH5B_SIGNAL                                  adc_ch5b   /*!< ADC1 signal: adc_ch5b */
#define INIT_ADC_PINS_ADC1_CH5B_PIN_NAME                                    PTA9   /*!< Pin name */
#define INIT_ADC_PINS_ADC1_CH5B_PIN_FUNCTION_ID            IOMUXC_PTA9_ADC1_CH5B   /*!< Pin function id */
#define INIT_ADC_PINS_ADC1_CH5B_LABEL                                "UART2_RTS"   /*!< Label */
#define INIT_ADC_PINS_ADC1_CH5B_NAME                                 "ADC1_CH5B"   /*!< Identifier name */

/* PTA10 (number AD16), UART2_TX */
#define INIT_ADC_PINS_ADC1_CH6A_PERIPHERAL                                  ADC1   /*!< Device name: ADC1 */
#define INIT_ADC_PINS_ADC1_CH6A_SIGNAL                                  adc_ch6a   /*!< ADC1 signal: adc_ch6a */
#define INIT_ADC_PINS_ADC1_CH6A_PIN_NAME                                   PTA10   /*!< Pin name */
#define INIT_ADC_PINS_ADC1_CH6A_PIN_FUNCTION_ID           IOMUXC_PTA10_ADC1_CH6A   /*!< Pin function id */
#define INIT_ADC_PINS_ADC1_CH6A_LABEL                                 "UART2_TX"   /*!< Label */
#define INIT_ADC_PINS_ADC1_CH6A_NAME                                 "ADC1_CH6A"   /*!< Identifier name */

/* PTA11 (number AD18), UART2_RX */
#define INIT_ADC_PINS_ADC1_CH6B_PERIPHERAL                                  ADC1   /*!< Device name: ADC1 */
#define INIT_ADC_PINS_ADC1_CH6B_SIGNAL                                  adc_ch6b   /*!< ADC1 signal: adc_ch6b */
#define INIT_ADC_PINS_ADC1_CH6B_PIN_NAME                                   PTA11   /*!< Pin name */
#define INIT_ADC_PINS_ADC1_CH6B_PIN_FUNCTION_ID           IOMUXC_PTA11_ADC1_CH6B   /*!< Pin function id */
#define INIT_ADC_PINS_ADC1_CH6B_LABEL                                 "UART2_RX"   /*!< Label */
#define INIT_ADC_PINS_ADC1_CH6B_NAME                                 "ADC1_CH6B"   /*!< Identifier name */

/* PTA22 (number AC20), EWM_OUT_B */
#define INIT_EWM_PINS_EWM_OUT_B_PERIPHERAL                                   EWM   /*!< Device name: EWM */
#define INIT_EWM_PINS_EWM_OUT_B_SIGNAL                                 ewm_out_b   /*!< EWM signal: ewm_out_b */
#define INIT_EWM_PINS_EWM_OUT_B_PIN_NAME                                   PTA22   /*!< Pin name */
#define INIT_EWM_PINS_EWM_OUT_B_PIN_FUNCTION_ID           IOMUXC_PTA22_EWM_OUT_B   /*!< Pin function id */
#define INIT_EWM_PINS_EWM_OUT_B_LABEL                                "EWM_OUT_B"   /*!< Label */
#define INIT_EWM_PINS_EWM_OUT_B_NAME                                 "EWM_OUT_B"   /*!< Identifier name */

/* PTA26 (number AF21), JTAG_TMS/SWD_DIO */
#define INIT_SJC_PINS_JTAG_TMS_PERIPHERAL                                   JTAG   /*!< Device name: JTAG */
#define INIT_SJC_PINS_JTAG_TMS_SIGNAL                                   jtag_tms   /*!< JTAG signal: jtag_tms */
#define INIT_SJC_PINS_JTAG_TMS_PIN_NAME                                    PTA26   /*!< Pin name */
#define INIT_SJC_PINS_JTAG_TMS_PIN_FUNCTION_ID     IOMUXC_PTA26_JTAG_TMS_SWD_DIO   /*!< Pin function id */
#define INIT_SJC_PINS_JTAG_TMS_LABEL                          "JTAG_TMS/SWD_DIO"   /*!< Label */
#define INIT_SJC_PINS_JTAG_TMS_NAME                                   "JTAG_TMS"   /*!< Identifier name */

/* PTA27 (number AF22), JTAG_TDO */
#define INIT_SJC_PINS_JTAG_TDO_PERIPHERAL                                   JTAG   /*!< Device name: JTAG */
#define INIT_SJC_PINS_JTAG_TDO_SIGNAL                                   jtag_tdo   /*!< JTAG signal: jtag_tdo */
#define INIT_SJC_PINS_JTAG_TDO_PIN_NAME                                    PTA27   /*!< Pin name */
#define INIT_SJC_PINS_JTAG_TDO_PIN_FUNCTION_ID             IOMUXC_PTA27_JTAG_TDO   /*!< Pin function id */
#define INIT_SJC_PINS_JTAG_TDO_LABEL                                  "JTAG_TDO"   /*!< Label */
#define INIT_SJC_PINS_JTAG_TDO_NAME                                   "JTAG_TDO"   /*!< Identifier name */

