SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.h
/* PTA28 (number AG22), JTAG_TDI */
#define INIT_SJC_PINS_JTAG_TDI_PERIPHERAL                                   JTAG   /*!< Device name: JTAG */
#define INIT_SJC_PINS_JTAG_TDI_SIGNAL                                   jtag_tdi   /*!< JTAG signal: jtag_tdi */
#define INIT_SJC_PINS_JTAG_TDI_PIN_NAME                                    PTA28   /*!< Pin name */
#define INIT_SJC_PINS_JTAG_TDI_PIN_FUNCTION_ID             IOMUXC_PTA28_JTAG_TDI   /*!< Pin function id */
#define INIT_SJC_PINS_JTAG_TDI_LABEL                                  "JTAG_TDI"   /*!< Label */
#define INIT_SJC_PINS_JTAG_TDI_NAME                                   "JTAG_TDI"   /*!< Identifier name */

/* PTA29 (number AD23), JTAG_TCLK/SWD_CLK */
#define INIT_SJC_PINS_JTAG_TCLK_PERIPHERAL                                  JTAG   /*!< Device name: JTAG */
#define INIT_SJC_PINS_JTAG_TCLK_SIGNAL                                 jtag_tclk   /*!< JTAG signal: jtag_tclk */
#define INIT_SJC_PINS_JTAG_TCLK_PIN_NAME                                   PTA29   /*!< Pin name */
#define INIT_SJC_PINS_JTAG_TCLK_PIN_FUNCTION_ID   IOMUXC_PTA29_JTAG_TCLK_SWD_CLK   /*!< Pin function id */
#define INIT_SJC_PINS_JTAG_TCLK_LABEL                        "JTAG_TCLK/SWD_CLK"   /*!< Label */
#define INIT_SJC_PINS_JTAG_TCLK_NAME                                 "JTAG_TCLK"   /*!< Identifier name */

/* PTA30 (number AD24), JTAG_TRST_B */
#define INIT_SJC_PINS_JTAG_TRST_B_PERIPHERAL                                JTAG   /*!< Device name: JTAG */
#define INIT_SJC_PINS_JTAG_TRST_B_SIGNAL                             jtag_trst_b   /*!< JTAG signal: jtag_trst_b */
#define INIT_SJC_PINS_JTAG_TRST_B_PIN_NAME                                 PTA30   /*!< Pin name */
#define INIT_SJC_PINS_JTAG_TRST_B_PIN_FUNCTION_ID       IOMUXC_PTA30_JTAG_TRST_B   /*!< Pin function id */
#define INIT_SJC_PINS_JTAG_TRST_B_LABEL                            "JTAG_TRST_B"   /*!< Label */
#define INIT_SJC_PINS_JTAG_TRST_B_NAME                             "JTAG_TRST_B"   /*!< Identifier name */

/* PTB8 (number AG6), QSPIA_SS0_B */
#define INIT_QSPI_PINS_QSPIA_SS0_B_PERIPHERAL                              QSPIA   /*!< Device name: QSPIA */
#define INIT_QSPI_PINS_QSPIA_SS0_B_SIGNAL                             qspia_ss_b   /*!< QSPIA signal: qspia_ss_b */
#define INIT_QSPI_PINS_QSPIA_SS0_B_CHANNEL                                     0   /*!< QSPIA qspia_ss_b channel: 0 */
#define INIT_QSPI_PINS_QSPIA_SS0_B_PIN_NAME                                 PTB8   /*!< Pin name */
#define INIT_QSPI_PINS_QSPIA_SS0_B_PIN_FUNCTION_ID       IOMUXC_PTB8_QSPIA_SS0_B   /*!< Pin function id */
#define INIT_QSPI_PINS_QSPIA_SS0_B_LABEL                           "QSPIA_SS0_B"   /*!< Label */
#define INIT_QSPI_PINS_QSPIA_SS0_B_NAME                            "QSPIA_SS0_B"   /*!< Identifier name */

/* PTB15 (number AF8), QSPIA_SCLK */
#define INIT_QSPI_PINS_QSPIA_SCLK_PERIPHERAL                               QSPIA   /*!< Device name: QSPIA */
#define INIT_QSPI_PINS_QSPIA_SCLK_SIGNAL                              qspia_sclk   /*!< QSPIA signal: qspia_sclk */
#define INIT_QSPI_PINS_QSPIA_SCLK_PIN_NAME                                 PTB15   /*!< Pin name */
#define INIT_QSPI_PINS_QSPIA_SCLK_PIN_FUNCTION_ID        IOMUXC_PTB15_QSPIA_SCLK   /*!< Pin function id */
#define INIT_QSPI_PINS_QSPIA_SCLK_LABEL                             "QSPIA_SCLK"   /*!< Label */
#define INIT_QSPI_PINS_QSPIA_SCLK_NAME                              "QSPIA_SCLK"   /*!< Identifier name */

/* PTB16 (number AF9), QSPIA_DATA3 */
#define INIT_QSPI_PINS_QSPIA_DATA3_PERIPHERAL                              QSPIA   /*!< Device name: QSPIA */
#define INIT_QSPI_PINS_QSPIA_DATA3_SIGNAL                             qspia_data   /*!< QSPIA signal: qspia_data */
#define INIT_QSPI_PINS_QSPIA_DATA3_CHANNEL                                     3   /*!< QSPIA qspia_data channel: 3 */
#define INIT_QSPI_PINS_QSPIA_DATA3_PIN_NAME                                PTB16   /*!< Pin name */
#define INIT_QSPI_PINS_QSPIA_DATA3_PIN_FUNCTION_ID      IOMUXC_PTB16_QSPIA_DATA3   /*!< Pin function id */
#define INIT_QSPI_PINS_QSPIA_DATA3_LABEL                           "QSPIA_DATA3"   /*!< Label */
#define INIT_QSPI_PINS_QSPIA_DATA3_NAME                            "QSPIA_DATA3"   /*!< Identifier name */

/* PTB17 (number AF10), QSPIA_DATA2 */
#define INIT_QSPI_PINS_QSPIA_DATA2_PERIPHERAL                              QSPIA   /*!< Device name: QSPIA */
#define INIT_QSPI_PINS_QSPIA_DATA2_SIGNAL                             qspia_data   /*!< QSPIA signal: qspia_data */
#define INIT_QSPI_PINS_QSPIA_DATA2_CHANNEL                                     2   /*!< QSPIA qspia_data channel: 2 */
#define INIT_QSPI_PINS_QSPIA_DATA2_PIN_NAME                                PTB17   /*!< Pin name */
#define INIT_QSPI_PINS_QSPIA_DATA2_PIN_FUNCTION_ID      IOMUXC_PTB17_QSPIA_DATA2   /*!< Pin function id */
#define INIT_QSPI_PINS_QSPIA_DATA2_LABEL                           "QSPIA_DATA2"   /*!< Label */
#define INIT_QSPI_PINS_QSPIA_DATA2_NAME                            "QSPIA_DATA2"   /*!< Identifier name */

/* PTB18 (number AG10), QSPIA_DATA1 */
#define INIT_QSPI_PINS_QSPIA_DATA1_PERIPHERAL                              QSPIA   /*!< Device name: QSPIA */
#define INIT_QSPI_PINS_QSPIA_DATA1_SIGNAL                             qspia_data   /*!< QSPIA signal: qspia_data */
#define INIT_QSPI_PINS_QSPIA_DATA1_CHANNEL                                     1   /*!< QSPIA qspia_data channel: 1 */
#define INIT_QSPI_PINS_QSPIA_DATA1_PIN_NAME                                PTB18   /*!< Pin name */
#define INIT_QSPI_PINS_QSPIA_DATA1_PIN_FUNCTION_ID      IOMUXC_PTB18_QSPIA_DATA1   /*!< Pin function id */
#define INIT_QSPI_PINS_QSPIA_DATA1_LABEL                           "QSPIA_DATA1"   /*!< Label */
#define INIT_QSPI_PINS_QSPIA_DATA1_NAME                            "QSPIA_DATA1"   /*!< Identifier name */

/* PTB19 (number AD10), QSPIA_DATA0 */
#define INIT_QSPI_PINS_QSPIA_DATA0_PERIPHERAL                              QSPIA   /*!< Device name: QSPIA */
#define INIT_QSPI_PINS_QSPIA_DATA0_SIGNAL                             qspia_data   /*!< QSPIA signal: qspia_data */
#define INIT_QSPI_PINS_QSPIA_DATA0_CHANNEL                                     0   /*!< QSPIA qspia_data channel: 0 */
#define INIT_QSPI_PINS_QSPIA_DATA0_PIN_NAME                                PTB19   /*!< Pin name */
#define INIT_QSPI_PINS_QSPIA_DATA0_PIN_FUNCTION_ID      IOMUXC_PTB19_QSPIA_DATA0   /*!< Pin function id */
#define INIT_QSPI_PINS_QSPIA_DATA0_LABEL                           "QSPIA_DATA0"   /*!< Label */
#define INIT_QSPI_PINS_QSPIA_DATA0_NAME                            "QSPIA_DATA0"   /*!< Identifier name */

/* PTB14 (number AG8), RTC_CLK */
#define INIT_RTC_PINS_RTC_CLK_PERIPHERAL                                     RTC   /*!< Device name: RTC */
#define INIT_RTC_PINS_RTC_CLK_SIGNAL                                  rtc_clkout   /*!< RTC signal: rtc_clkout */
#define INIT_RTC_PINS_RTC_CLK_PIN_NAME                                     PTB14   /*!< Pin name */
#define INIT_RTC_PINS_RTC_CLK_PIN_FUNCTION_ID            IOMUXC_PTB14_RTC_CLKOUT   /*!< Pin function id */
#define INIT_RTC_PINS_RTC_CLK_LABEL                                    "RTC_CLK"   /*!< Label */
#define INIT_RTC_PINS_RTC_CLK_NAME                                     "RTC_CLK"   /*!< Identifier name */

/* PTC13 (coord D13), USB_OTG_ID */
#define INIT_USB_PINS_USB_OTG_ID_PERIPHERAL                                 USB0   /*!< Device name: USB0 */
#define INIT_USB_PINS_USB_OTG_ID_SIGNAL                                  usb0_id   /*!< USB0 signal: usb0_id */
#define INIT_USB_PINS_USB_OTG_ID_PIN_NAME                                  PTC13   /*!< Pin name */
#define INIT_USB_PINS_USB_OTG_ID_PIN_FUNCTION_ID            IOMUXC_PTC13_USB0_ID   /*!< Pin function id */
#define INIT_USB_PINS_USB_OTG_ID_LABEL                              "USB_OTG_ID"   /*!< Label */
#define INIT_USB_PINS_USB_OTG_ID_NAME                               "USB_OTG_ID"   /*!< Identifier name */

