SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.h
/* PTC16 (coord G13), USB_OTG_OC */
#define INIT_USB_PINS_USB_OTG_OC_PERIPHERAL                                 USB1   /*!< Device name: USB1 */
#define INIT_USB_PINS_USB_OTG_OC_SIGNAL                                  usb1_oc   /*!< USB1 signal: usb1_oc */
#define INIT_USB_PINS_USB_OTG_OC_CHANNEL                                       2   /*!< USB1 usb1_oc channel: 2 */
#define INIT_USB_PINS_USB_OTG_OC_PIN_NAME                                  PTC16   /*!< Pin name */
#define INIT_USB_PINS_USB_OTG_OC_PIN_FUNCTION_ID           IOMUXC_PTC16_USB1_OC2   /*!< Pin function id */
#define INIT_USB_PINS_USB_OTG_OC_LABEL                              "USB_OTG_OC"   /*!< Label */
#define INIT_USB_PINS_USB_OTG_OC_NAME                               "USB_OTG_OC"   /*!< Identifier name */

/* PTD0 (coord A24), SD0_nRST */
#define INIT_SDHC_PINS_SD0_nRST_PERIPHERAL                                 SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_nRST_SIGNAL                              sdhc_reset_b   /*!< SDHC0 signal: sdhc_reset_b */
#define INIT_SDHC_PINS_SD0_nRST_PIN_NAME                                    PTD0   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_nRST_PIN_FUNCTION_ID        IOMUXC_PTD0_SDHC0_RESET_B   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_nRST_LABEL                                 "SD0_nRST"   /*!< Label */
#define INIT_SDHC_PINS_SD0_nRST_NAME                                  "SD0_nRST"   /*!< Identifier name */

/* PTD1 (coord B24), SD0_CMD */
#define INIT_SDHC_PINS_SD0_CMD_PERIPHERAL                                  SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_CMD_SIGNAL                                   sdhc_cmd   /*!< SDHC0 signal: sdhc_cmd */
#define INIT_SDHC_PINS_SD0_CMD_PIN_NAME                                     PTD1   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_CMD_PIN_FUNCTION_ID             IOMUXC_PTD1_SDHC0_CMD   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_CMD_LABEL                                   "SD0_CMD"   /*!< Label */
#define INIT_SDHC_PINS_SD0_CMD_NAME                                    "SD0_CMD"   /*!< Identifier name */

/* PTD2 (coord B23), SD0_CLK */
#define INIT_SDHC_PINS_SD0_CLK_PERIPHERAL                                  SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_CLK_SIGNAL                                   sdhc_clk   /*!< SDHC0 signal: sdhc_clk */
#define INIT_SDHC_PINS_SD0_CLK_PIN_NAME                                     PTD2   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_CLK_PIN_FUNCTION_ID             IOMUXC_PTD2_SDHC0_CLK   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_CLK_LABEL                                   "SD0_CLK"   /*!< Label */
#define INIT_SDHC_PINS_SD0_CLK_NAME                                    "SD0_CLK"   /*!< Identifier name */

/* PTD3 (coord B22), SD0_DATA7 */
#define INIT_SDHC_PINS_SD0_DATA7_PERIPHERAL                                SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_DATA7_SIGNAL                                   sdhc_d   /*!< SDHC0 signal: sdhc_d */
#define INIT_SDHC_PINS_SD0_DATA7_CHANNEL                                       7   /*!< SDHC0 sdhc_d channel: 7 */
#define INIT_SDHC_PINS_SD0_DATA7_PIN_NAME                                   PTD3   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_DATA7_PIN_FUNCTION_ID            IOMUXC_PTD3_SDHC0_D7   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_DATA7_LABEL                               "SD0_DATA7"   /*!< Label */
#define INIT_SDHC_PINS_SD0_DATA7_NAME                                "SD0_DATA7"   /*!< Identifier name */

/* PTD4 (coord A22), SD0_DATA6 */
#define INIT_SDHC_PINS_SD0_DATA6_PERIPHERAL                                SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_DATA6_SIGNAL                                   sdhc_d   /*!< SDHC0 signal: sdhc_d */
#define INIT_SDHC_PINS_SD0_DATA6_CHANNEL                                       6   /*!< SDHC0 sdhc_d channel: 6 */
#define INIT_SDHC_PINS_SD0_DATA6_PIN_NAME                                   PTD4   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_DATA6_PIN_FUNCTION_ID            IOMUXC_PTD4_SDHC0_D6   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_DATA6_LABEL                               "SD0_DATA6"   /*!< Label */
#define INIT_SDHC_PINS_SD0_DATA6_NAME                                "SD0_DATA6"   /*!< Identifier name */

/* PTD5 (coord D21), SD0_DATA5 */
#define INIT_SDHC_PINS_SD0_DATA5_PERIPHERAL                                SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_DATA5_SIGNAL                                   sdhc_d   /*!< SDHC0 signal: sdhc_d */
#define INIT_SDHC_PINS_SD0_DATA5_CHANNEL                                       5   /*!< SDHC0 sdhc_d channel: 5 */
#define INIT_SDHC_PINS_SD0_DATA5_PIN_NAME                                   PTD5   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_DATA5_PIN_FUNCTION_ID            IOMUXC_PTD5_SDHC0_D5   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_DATA5_LABEL                               "SD0_DATA5"   /*!< Label */
#define INIT_SDHC_PINS_SD0_DATA5_NAME                                "SD0_DATA5"   /*!< Identifier name */

/* PTD6 (coord D22), SD0_DATA4 */
#define INIT_SDHC_PINS_SD0_DATA4_PERIPHERAL                                SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_DATA4_SIGNAL                                   sdhc_d   /*!< SDHC0 signal: sdhc_d */
#define INIT_SDHC_PINS_SD0_DATA4_CHANNEL                                       4   /*!< SDHC0 sdhc_d channel: 4 */
#define INIT_SDHC_PINS_SD0_DATA4_PIN_NAME                                   PTD6   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_DATA4_PIN_FUNCTION_ID            IOMUXC_PTD6_SDHC0_D4   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_DATA4_LABEL                               "SD0_DATA4"   /*!< Label */
#define INIT_SDHC_PINS_SD0_DATA4_NAME                                "SD0_DATA4"   /*!< Identifier name */

/* PTD7 (coord A20), SD0_DATA3 */
#define INIT_SDHC_PINS_SD0_DATA3_PERIPHERAL                                SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_DATA3_SIGNAL                                   sdhc_d   /*!< SDHC0 signal: sdhc_d */
#define INIT_SDHC_PINS_SD0_DATA3_CHANNEL                                       3   /*!< SDHC0 sdhc_d channel: 3 */
#define INIT_SDHC_PINS_SD0_DATA3_PIN_NAME                                   PTD7   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_DATA3_PIN_FUNCTION_ID            IOMUXC_PTD7_SDHC0_D3   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_DATA3_LABEL                               "SD0_DATA3"   /*!< Label */
#define INIT_SDHC_PINS_SD0_DATA3_NAME                                "SD0_DATA3"   /*!< Identifier name */

