SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.h
/* PTD8 (coord B20), SD0_DATA2 */
#define INIT_SDHC_PINS_SD0_DATA2_PERIPHERAL                                SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_DATA2_SIGNAL                                   sdhc_d   /*!< SDHC0 signal: sdhc_d */
#define INIT_SDHC_PINS_SD0_DATA2_CHANNEL                                       2   /*!< SDHC0 sdhc_d channel: 2 */
#define INIT_SDHC_PINS_SD0_DATA2_PIN_NAME                                   PTD8   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_DATA2_PIN_FUNCTION_ID            IOMUXC_PTD8_SDHC0_D2   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_DATA2_LABEL                               "SD0_DATA2"   /*!< Label */
#define INIT_SDHC_PINS_SD0_DATA2_NAME                                "SD0_DATA2"   /*!< Identifier name */

/* PTD9 (coord B19), SD0_DATA1 */
#define INIT_SDHC_PINS_SD0_DATA1_PERIPHERAL                                SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_DATA1_SIGNAL                                   sdhc_d   /*!< SDHC0 signal: sdhc_d */
#define INIT_SDHC_PINS_SD0_DATA1_CHANNEL                                       1   /*!< SDHC0 sdhc_d channel: 1 */
#define INIT_SDHC_PINS_SD0_DATA1_PIN_NAME                                   PTD9   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_DATA1_PIN_FUNCTION_ID            IOMUXC_PTD9_SDHC0_D1   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_DATA1_LABEL                               "SD0_DATA1"   /*!< Label */
#define INIT_SDHC_PINS_SD0_DATA1_NAME                                "SD0_DATA1"   /*!< Identifier name */

/* PTD10 (coord B18), SD0_DATA0 */
#define INIT_SDHC_PINS_SD0_DATA0_PERIPHERAL                                SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_DATA0_SIGNAL                                   sdhc_d   /*!< SDHC0 signal: sdhc_d */
#define INIT_SDHC_PINS_SD0_DATA0_CHANNEL                                       0   /*!< SDHC0 sdhc_d channel: 0 */
#define INIT_SDHC_PINS_SD0_DATA0_PIN_NAME                                  PTD10   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_DATA0_PIN_FUNCTION_ID           IOMUXC_PTD10_SDHC0_D0   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_DATA0_LABEL                               "SD0_DATA0"   /*!< Label */
#define INIT_SDHC_PINS_SD0_DATA0_NAME                                "SD0_DATA0"   /*!< Identifier name */

/* PTD11 (coord A18), SD0_DQS */
#define INIT_SDHC_PINS_SD0_DQS_PERIPHERAL                                  SDHC0   /*!< Device name: SDHC0 */
#define INIT_SDHC_PINS_SD0_DQS_SIGNAL                                   sdhc_dqs   /*!< SDHC0 signal: sdhc_dqs */
#define INIT_SDHC_PINS_SD0_DQS_PIN_NAME                                    PTD11   /*!< Pin name */
#define INIT_SDHC_PINS_SD0_DQS_PIN_FUNCTION_ID            IOMUXC_PTD11_SDHC0_DQS   /*!< Pin function id */
#define INIT_SDHC_PINS_SD0_DQS_LABEL                                   "SD0_DQS"   /*!< Label */
#define INIT_SDHC_PINS_SD0_DQS_NAME                                    "SD0_DQS"   /*!< Identifier name */

/* PTE0 (coord D12), WL_SD1_DATA1 */
#define INIT_SDHC_PINS_WL_SD1_DATA1_PERIPHERAL                             SDHC1   /*!< Device name: SDHC1 */
#define INIT_SDHC_PINS_WL_SD1_DATA1_SIGNAL                                sdhc_d   /*!< SDHC1 signal: sdhc_d */
#define INIT_SDHC_PINS_WL_SD1_DATA1_CHANNEL                                    1   /*!< SDHC1 sdhc_d channel: 1 */
#define INIT_SDHC_PINS_WL_SD1_DATA1_PIN_NAME                                PTE0   /*!< Pin name */
#define INIT_SDHC_PINS_WL_SD1_DATA1_PIN_FUNCTION_ID         IOMUXC_PTE0_SDHC1_D1   /*!< Pin function id */
#define INIT_SDHC_PINS_WL_SD1_DATA1_LABEL                         "WL_SD1_DATA1"   /*!< Label */
#define INIT_SDHC_PINS_WL_SD1_DATA1_NAME                          "WL_SD1_DATA1"   /*!< Identifier name */

/* PTE1 (coord A12), WL_SD1_DATA0 */
#define INIT_SDHC_PINS_WL_SD1_DATA0_PERIPHERAL                             SDHC1   /*!< Device name: SDHC1 */
#define INIT_SDHC_PINS_WL_SD1_DATA0_SIGNAL                                sdhc_d   /*!< SDHC1 signal: sdhc_d */
#define INIT_SDHC_PINS_WL_SD1_DATA0_CHANNEL                                    0   /*!< SDHC1 sdhc_d channel: 0 */
#define INIT_SDHC_PINS_WL_SD1_DATA0_PIN_NAME                                PTE1   /*!< Pin name */
#define INIT_SDHC_PINS_WL_SD1_DATA0_PIN_FUNCTION_ID         IOMUXC_PTE1_SDHC1_D0   /*!< Pin function id */
#define INIT_SDHC_PINS_WL_SD1_DATA0_LABEL                         "WL_SD1_DATA0"   /*!< Label */
#define INIT_SDHC_PINS_WL_SD1_DATA0_NAME                          "WL_SD1_DATA0"   /*!< Identifier name */

/* PTE2 (coord B12), WL_SD1_CLK */
#define INIT_SDHC_PINS_WL_SD1_CLK_PERIPHERAL                               SDHC1   /*!< Device name: SDHC1 */
#define INIT_SDHC_PINS_WL_SD1_CLK_SIGNAL                                sdhc_clk   /*!< SDHC1 signal: sdhc_clk */
#define INIT_SDHC_PINS_WL_SD1_CLK_PIN_NAME                                  PTE2   /*!< Pin name */
#define INIT_SDHC_PINS_WL_SD1_CLK_PIN_FUNCTION_ID          IOMUXC_PTE2_SDHC1_CLK   /*!< Pin function id */
#define INIT_SDHC_PINS_WL_SD1_CLK_LABEL                             "WL_SD1_CLK"   /*!< Label */
#define INIT_SDHC_PINS_WL_SD1_CLK_NAME                              "WL_SD1_CLK"   /*!< Identifier name */

/* PTE3 (coord B11), WL_SD1_CMD */
#define INIT_SDHC_PINS_WL_SD1_CMD_PERIPHERAL                               SDHC1   /*!< Device name: SDHC1 */
#define INIT_SDHC_PINS_WL_SD1_CMD_SIGNAL                                sdhc_cmd   /*!< SDHC1 signal: sdhc_cmd */
#define INIT_SDHC_PINS_WL_SD1_CMD_PIN_NAME                                  PTE3   /*!< Pin name */
#define INIT_SDHC_PINS_WL_SD1_CMD_PIN_FUNCTION_ID          IOMUXC_PTE3_SDHC1_CMD   /*!< Pin function id */
#define INIT_SDHC_PINS_WL_SD1_CMD_LABEL                             "WL_SD1_CMD"   /*!< Label */
#define INIT_SDHC_PINS_WL_SD1_CMD_NAME                              "WL_SD1_CMD"   /*!< Identifier name */

/* PTE4 (coord B10), WL_SD1_DATA3 */
#define INIT_SDHC_PINS_WL_SD1_DATA3_PERIPHERAL                             SDHC1   /*!< Device name: SDHC1 */
#define INIT_SDHC_PINS_WL_SD1_DATA3_SIGNAL                                sdhc_d   /*!< SDHC1 signal: sdhc_d */
#define INIT_SDHC_PINS_WL_SD1_DATA3_CHANNEL                                    3   /*!< SDHC1 sdhc_d channel: 3 */
#define INIT_SDHC_PINS_WL_SD1_DATA3_PIN_NAME                                PTE4   /*!< Pin name */
#define INIT_SDHC_PINS_WL_SD1_DATA3_PIN_FUNCTION_ID         IOMUXC_PTE4_SDHC1_D3   /*!< Pin function id */
#define INIT_SDHC_PINS_WL_SD1_DATA3_LABEL                         "WL_SD1_DATA3"   /*!< Label */
#define INIT_SDHC_PINS_WL_SD1_DATA3_NAME                          "WL_SD1_DATA3"   /*!< Identifier name */

/* PTE5 (coord A10), WL_SD1_DATA2 */
#define INIT_SDHC_PINS_WL_SD1_DATA2_PERIPHERAL                             SDHC1   /*!< Device name: SDHC1 */
#define INIT_SDHC_PINS_WL_SD1_DATA2_SIGNAL                                sdhc_d   /*!< SDHC1 signal: sdhc_d */
#define INIT_SDHC_PINS_WL_SD1_DATA2_CHANNEL                                    2   /*!< SDHC1 sdhc_d channel: 2 */
#define INIT_SDHC_PINS_WL_SD1_DATA2_PIN_NAME                                PTE5   /*!< Pin name */
#define INIT_SDHC_PINS_WL_SD1_DATA2_PIN_FUNCTION_ID         IOMUXC_PTE5_SDHC1_D2   /*!< Pin function id */
#define INIT_SDHC_PINS_WL_SD1_DATA2_LABEL                         "WL_SD1_DATA2"   /*!< Label */
#define INIT_SDHC_PINS_WL_SD1_DATA2_NAME                          "WL_SD1_DATA2"   /*!< Identifier name */

