SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.h
/* PTE14 (coord B6), SD1_VSEL */
#define INIT_SDHC_PINS_SD1_VSEL_PERIPHERAL                                 SDHC1   /*!< Device name: SDHC1 */
#define INIT_SDHC_PINS_SD1_VSEL_SIGNAL                                   sdhc_vs   /*!< SDHC1 signal: sdhc_vs */
#define INIT_SDHC_PINS_SD1_VSEL_PIN_NAME                                   PTE14   /*!< Pin name */
#define INIT_SDHC_PINS_SD1_VSEL_PIN_FUNCTION_ID            IOMUXC_PTE14_SDHC1_VS   /*!< Pin function id */
#define INIT_SDHC_PINS_SD1_VSEL_LABEL                                 "SD1_VSEL"   /*!< Label */
#define INIT_SDHC_PINS_SD1_VSEL_NAME                                  "SD1_VSEL"   /*!< Identifier name */

/* PTF2 (coord B3), LED_PWM_EN */
#define INIT_TPM_PINS_LED_PWM_EN_PERIPHERAL                                 TPM4   /*!< Device name: TPM4 */
#define INIT_TPM_PINS_LED_PWM_EN_SIGNAL                                   tpm_ch   /*!< TPM4 signal: tpm_ch */
#define INIT_TPM_PINS_LED_PWM_EN_CHANNEL                                       1   /*!< TPM4 tpm_ch channel: 1 */
#define INIT_TPM_PINS_LED_PWM_EN_PIN_NAME                                   PTF2   /*!< Pin name */
#define INIT_TPM_PINS_LED_PWM_EN_PIN_FUNCTION_ID            IOMUXC_PTF2_TPM4_CH1   /*!< Pin function id */
#define INIT_TPM_PINS_LED_PWM_EN_LABEL                              "LED_PWM_EN"   /*!< Label */
#define INIT_TPM_PINS_LED_PWM_EN_NAME                               "LED_PWM_EN"   /*!< Identifier name */

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_gpio_pins(void);                                 /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_i2s_pins(void);                                  /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_uart_pins(void);                                 /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_i2c_pins(void);                                  /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_adc_pins(void);                                  /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_ewm_pins(void);                                  /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_sjc_pins(void);                                  /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_qspi_pins(void);                                 /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_rtc_pins(void);                                  /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_usb_pins(void);                                  /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_sdhc_pins(void);                                 /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void init_tpm_pins(void);                                  /*!< Function assigned for the core: Cortex-M4[cm4] */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
